Reports/ОбщиеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОбщиеНастройки</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ОбщиеНастройки/Forms/ФормаНастройкаВыгрузкиВPDM/Ext/Form/Module.bsl
Процедура СохранитьНастройку(ИмяНастройки,ЗначениеНастройки,текПользователь)
	
	МенеджерЗаписи = РегистрыСведений.НастройкиПроекта.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяНастройки 	= ИмяНастройки;
	МенеджерЗаписи.НомерНастройки 	= 0;
	МенеджерЗаписи.Пользователь 	= текПользователь;
	МенеджерЗаписи.Значение 		= ЗначениеНастройки; 
	
	МенеджерЗаписи.Записать();

КонецПроцедуры // СохранитьНастройку()

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 Параметры.Свойство("Пользователь", 					Пользователь);
	 Параметры.Свойство("ПутьКФайлуEXE", 					ПутьКФайлуEXE);
	 Параметры.Свойство("ПутьКФайлуЗагрузки", 				ПутьКФайлуЗагрузки);
	 Параметры.Свойство("ПутьКФайлуEXEПроекта", 			ПутьКФайлуEXEПроекта);
	 Параметры.Свойство("ПутьКФайлуEXEКонструктор", 		ПутьКФайлуEXEКонструктор);
	 Параметры.Свойство("ПутьКФайлуEXEКомпозиция", 			ПутьКФайлуEXEКомпозиция);
	 Параметры.Свойство("ПутьКФайлуEXEГабаритныйЧерчеж", 	ПутьКФайлуEXEГабаритныйЧерчеж);
	 Параметры.Свойство("ПутьКФайлуEXEИзменениеСтатусаГЧ", 	ПутьКФайлуEXEИзменениеСтатусаГЧ);
	 Параметры.Свойство("ПутьКФайлуEXEЗагрузкаТЗ", 			ПутьКФайлуEXEЗагрузкаТЗ);
КонецПроцедуры

&НаКлиенте         
Процедура ПутьКФайлуEXEНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Режим 		= РежимДиалогаВыбораФайла.Открытие;
	Заголовок  	= "Выберите файл";
	Оповещение 	= Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтаФорма,Новый Структура("ЭлементВыбора",Элемент.Имя));
	ПолучитьДиалогВыбораФайла(ЭтаФорма.ПутьКФайлуEXE, Оповещение, Режим, Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	Заголовок  	= "Выберите каталог";
	Оповещение = Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтаФорма,Новый Структура("ЭлементВыбора","ПутьКФайлуЗагрузки"));
	ПолучитьДиалогВыбораФайла(ЭтаФорма.ПутьКФайлуЗагрузки, Оповещение, Режим, Заголовок);
КонецПроцедуры 

&НаКлиенте
Процедура ВыборКаталога_Завершение(Результат, ДополнительныеДанные) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ЭтаФорма[ДополнительныеДанные.ЭлементВыбора] = Результат[0];
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДиалогВыбораФайла(НачальноеИмяКаталога, Оповещение, Режим, Заголовок)
	
	ДиалогОткрытия 						= Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог 				= НачальноеИмяКаталога;
	ДиалогОткрытия.МножественныйВыбор 	= Ложь;
	ДиалогОткрытия.Заголовок 			= "Выберите каталог";
	ДиалогОткрытия.Показать(Оповещение);
КонецФункции // ПолучитьДиалогВыбораФайла()

&НаКлиенте
Процедура Перенести(Команда)
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		ПоказатьПредупреждение(,"На заполнен пользователь");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ПутьКФайлуEXE) Тогда
		ПоказатьПредупреждение(,"На заполнен Путь к файлу EXE комплекта");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ПутьКФайлуЗагрузки) Тогда
		ПоказатьПредупреждение(,"На заполнен Путь к каталогу загрузки");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ПутьКФайлуEXEПроекта) Тогда
		ПоказатьПредупреждение(,"На заполнен Путь к файлу EXE  Проекты");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ПутьКФайлуEXEКомпозиция) Тогда
		ПоказатьПредупреждение(,"На заполнен Путь к файлу EXE  композиции");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ПутьКФайлуEXEГабаритныйЧерчеж) Тогда
		ПоказатьПредупреждение(,"На заполнен Путь к файлу EXE  ГЧ");
		Возврат;
	КонецЕсли;
	           
	Если ПустаяСтрока(ПутьКФайлуEXEИзменениеСтатусаГЧ) Тогда
		ПоказатьПредупреждение(,"На заполнен Путь к файлу EXE  изменение статуса ГЧ");
		Возврат;
	КонецЕсли;
	           
	Если ПустаяСтрока(ПутьКФайлуEXEЗагрузкаТЗ) Тогда
		ПоказатьПредупреждение(,"На заполнен Путь к файлу EXE  выгрузки ТЗ");
		Возврат;
	КонецЕсли;
	           
	стДанные = Новый Структура("СразуЗапускатьEXEPDM, Пользователь, ПутьКФайлуEXE, ПутьКФайлуЗагрузки, ПутьКФайлуEXEПроекта, ПутьКФайлуEXEКонструктор, ПутьКФайлуEXEКомпозиция, ПутьКФайлуEXEГабаритныйЧерчеж, ПутьКФайлуEXEИзменениеСтатусаГЧ, ПутьКФайлуEXEЗагрузкаТЗ", );
	ЗаполнитьЗначенияСвойств(стДанные, ЭтаФорма);
	ЭтаФорма.Закрыть(стДанные);
КонецПроцедуры

                      
&НаКлиенте
Процедура ПутьКФайлуEXEКонструкторНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Режим 		= РежимДиалогаВыбораФайла.Открытие;
	Заголовок  	= "Выберите файл Конструктора";
	Оповещение 	= Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтаФорма,Новый Структура("ЭлементВыбора",Элемент.Имя));
	ПолучитьДиалогВыбораФайла(ЭтаФорма.ПутьКФайлуEXEКонструктор, Оповещение, Режим, Заголовок);
КонецПроцедуры


&НаКлиенте
Процедура ПутьКФайлуEXEСделкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Режим 		= РежимДиалогаВыбораФайла.Открытие;
	Заголовок  	= "Выберите файл Проекты";
	Оповещение 	= Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтаФорма,Новый Структура("ЭлементВыбора",Элемент.Имя));
	ПолучитьДиалогВыбораФайла(ЭтаФорма.ПутьКФайлуEXEПроекта, Оповещение, Режим, Заголовок);
КонецПроцедуры


&НаКлиенте
Процедура ПутьКФайлуEXEКомпозицияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Режим 		= РежимДиалогаВыбораФайла.Открытие;
	Заголовок  	= "Выберите файл Композиции";
	Оповещение 	= Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтаФорма,Новый Структура("ЭлементВыбора",Элемент.Имя));
	ПолучитьДиалогВыбораФайла(ЭтаФорма.ПутьКФайлуEXEПроекта, Оповещение, Режим, Заголовок);
КонецПроцедуры


&НаКлиенте
Процедура ПутьКФайлуEXEГабаритныйЧерчежНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Режим 		= РежимДиалогаВыбораФайла.Открытие;
	Заголовок  	= "Выберите файл ГЧ";
	Оповещение 	= Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтаФорма,Новый Структура("ЭлементВыбора",Элемент.Имя));
	ПолучитьДиалогВыбораФайла(ЭтаФорма.ПутьКФайлуEXEГабаритныйЧерчеж, Оповещение, Режим, Заголовок);
КонецПроцедуры


&НаКлиенте
Процедура ПутьКФайлуEXEИзменениеСтатусаГЧНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Режим 		= РежимДиалогаВыбораФайла.Открытие;
	Заголовок  	= "Выберите файл изменения статуса ГЧ";
	Оповещение 	= Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтаФорма,Новый Структура("ЭлементВыбора",Элемент.Имя));
	ПолучитьДиалогВыбораФайла(ЭтаФорма.ПутьКФайлуEXEИзменениеСтатусаГЧ, Оповещение, Режим, Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуEXEЗагрузкаТЗНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Режим 		= РежимДиалогаВыбораФайла.Открытие;
	Заголовок  	= "Выберите файл загрузки ТЗ";
	Оповещение 	= Новый ОписаниеОповещения("ВыборКаталога_Завершение", ЭтаФорма,Новый Структура("ЭлементВыбора",Элемент.Имя));
	ПолучитьДиалогВыбораФайла(ЭтаФорма.ПутьКФайлуEXEЗагрузкаТЗ, Оповещение, Режим, Заголовок);
КонецПроцедуры
